## Assignment 20: The goal of this assignment was to reshape and join data in R. Below are the steps I followed to complete the assignment.

### 1. Create a “wide” dataset and turn it to a “long” dataset.

In [13]:
df_wide = data.frame(time = as.Date('2009-01-01')+ 0:9,
Jake = rnorm(10, 95, 1), Ryan = rnorm(10, 90, 5), Elijah =rnorm(10,93,2))
df_wide

library(tidyr)
df_long = gather(data = df_wide, Jake, Ryan, 
Elijah, key = 'Student', value =  'Quiz Score')
df_long

   time       Jake     Ryan     Elijah
1  2009-01-01 92.77184 88.64030 94.64437
2  2009-01-02 94.41316 88.13829 94.61101
3  2009-01-03 95.46862 93.02045 90.53657
4  2009-01-04 96.21247 80.33129 90.56713
5  2009-01-05 94.14681 92.06069 91.41750
6  2009-01-06 94.70899 95.10218 95.45096
7  2009-01-07 94.17983 81.41120 93.78913
8  2009-01-08 94.60296 85.57313 91.64874
9  2009-01-09 96.57046 88.99817 95.81065
10 2009-01-10 92.53229 85.15884 94.72742

   time       Student Quiz Score
1  2009-01-01 Jake    92.77184
2  2009-01-02 Jake    94.41316
3  2009-01-03 Jake    95.46862
4  2009-01-04 Jake    96.21247
5  2009-01-05 Jake    94.14681
6  2009-01-06 Jake    94.70899
7  2009-01-07 Jake    94.17983
8  2009-01-08 Jake    94.60296
9  2009-01-09 Jake    96.57046
10 2009-01-10 Jake    92.53229
11 2009-01-01 Ryan    88.64030
12 2009-01-02 Ryan    88.13829
13 2009-01-03 Ryan    93.02045
14 2009-01-04 Ryan    80.33129
15 2009-01-05 Ryan    92.06069
16 2009-01-06 Ryan    95.10218
17 2009-01-07 Ryan    81.41120
18 2009-01-08 Ryan    85.57313
19 2009-01-09 Ryan    88.99817
20 2009-01-10 Ryan    85.15884
21 2009-01-01 Elijah  94.64437
22 2009-01-02 Elijah  94.61101
23 2009-01-03 Elijah  90.53657
24 2009-01-04 Elijah  90.56713
25 2009-01-05 Elijah  91.41750
26 2009-01-06 Elijah  95.45096
27 2009-01-07 Elijah  93.78913
28 2009-01-08 Elijah  91.64874
29 2009-01-09 Elijah  95.81065
30 2009-01-10 Elijah  94.72742

### 2.	Create a “long” dataset and turn it to a “wide” dataset.

In [14]:
df_long2 = data.frame(Day = c("M","W","F","M","W","F", "M", "W", "F"), Student = c("Jake","Jake","Jake", "Ryan","Ryan","Ryan", "Elijah", "Elijah", "Elijah"), sleephrs = c(rnorm(3, 8, 1.5), rnorm(3, 7, 2), rnorm(3, 9, 1)))
df_long2

df_wide2 = spread(data = df_long2, key = 'Student', value = 'sleephrs')
df_wide2

  Day Student sleephrs
1 M   Jake    9.680476
2 W   Jake    7.141227
3 F   Jake    9.123281
4 M   Ryan    6.744510
5 W   Ryan    2.754875
6 F   Ryan    9.126532
7 M   Elijah  8.998083
8 W   Elijah  9.897219
9 F   Elijah  9.564009

  Day Elijah   Jake     Ryan
1 F   9.564009 9.123281 9.126532
2 M   8.998083 9.680476 6.744510
3 W   9.897219 7.141227 2.754875

### 3.	Create a dataset, d1, of five Bryant students with 3 variables: Name, Major, and GPA.  Primary key is Name.

In [15]:
d1 = data.frame(Name = c("Mackenzie", "Allie", "Luke", "Elijah", "Abdallah"), Major = c("Human Resources", "Politics and Law", "Accounting", "Actuarial Math", "Marketing"), GPA = c("3.4", "3.4", "3.75", "3.95", "3.1"))
d1

  Name      Major            GPA
1 Mackenzie Human Resources  3.4
2 Allie     Politics and Law 3.4
3 Luke      Accounting       3.75
4 Elijah    Actuarial Math   3.95
5 Abdallah  Marketing        3.1

### 4.	Create a dataset, d2, of five Bryant students, two of them are also in d1, the others are not in d1, with 3 variables: Name, Major, and Salary.

In [16]:
d2 = data.frame(Name = c("Mackenzie", "Elijah", "Jake", "Fryer", "Tyler"), Major = c("Human Resources", "Actuarial Math", "Actuarial Math", "Actuarial Math", "Marketing"), Salary = c("54,000", "70,000", "82,000", "68,000", "40,000"))
d2

  Name      Major           Salary
1 Mackenzie Human Resources 54,000
2 Elijah    Actuarial Math  70,000
3 Jake      Actuarial Math  82,000
4 Fryer     Actuarial Math  68,000
5 Tyler     Marketing       40,000

### 5.	Join d1 and d2 in 6 different ways, by the primary key.

In [17]:
library(dplyr)
left_join(d1, d2, by = c('Name'))
right_join(d1, d2, by = c('Name'))
full_join(d1, d2, by = c('Name'))
inner_join(d1, d2, by = c('Name'))
anti_join(d1, d2, by = c('Name'))
semi_join(d1, d2, by = c('Name'))

Warning message:
"Column `Name` joining factors with different levels, coercing to character vector"

  Name      Major.x          GPA  Major.y         Salary
1 Mackenzie Human Resources  3.4  Human Resources 54,000
2 Allie     Politics and Law 3.4  NA              NA
3 Luke      Accounting       3.75 NA              NA
4 Elijah    Actuarial Math   3.95 Actuarial Math  70,000
5 Abdallah  Marketing        3.1  NA              NA

Warning message:
"Column `Name` joining factors with different levels, coercing to character vector"

  Name      Major.x         GPA  Major.y         Salary
1 Mackenzie Human Resources 3.4  Human Resources 54,000
2 Elijah    Actuarial Math  3.95 Actuarial Math  70,000
3 Jake      NA              NA   Actuarial Math  82,000
4 Fryer     NA              NA   Actuarial Math  68,000
5 Tyler     NA              NA   Marketing       40,000

Warning message:
"Column `Name` joining factors with different levels, coercing to character vector"

  Name      Major.x          GPA  Major.y         Salary
1 Mackenzie Human Resources  3.4  Human Resources 54,000
2 Allie     Politics and Law 3.4  NA              NA
3 Luke      Accounting       3.75 NA              NA
4 Elijah    Actuarial Math   3.95 Actuarial Math  70,000
5 Abdallah  Marketing        3.1  NA              NA
6 Jake      NA               NA   Actuarial Math  82,000
7 Fryer     NA               NA   Actuarial Math  68,000
8 Tyler     NA               NA   Marketing       40,000

Warning message:
"Column `Name` joining factors with different levels, coercing to character vector"

  Name      Major.x         GPA  Major.y         Salary
1 Mackenzie Human Resources 3.4  Human Resources 54,000
2 Elijah    Actuarial Math  3.95 Actuarial Math  70,000

Warning message:
"Column `Name` joining factors with different levels, coercing to character vector"

  Name     Major            GPA
1 Allie    Politics and Law 3.4
2 Luke     Accounting       3.75
3 Abdallah Marketing        3.1

Warning message:
"Column `Name` joining factors with different levels, coercing to character vector"

  Name      Major           GPA
1 Mackenzie Human Resources 3.4
2 Elijah    Actuarial Math  3.95

### 6.	Redo 5 with the primary keys are two variables.

In [18]:
left_join(d1, d2, by = c('Name', 'Major')) #Adds columns from d2 to d1
right_join(d1, d2, by = c('Name', 'Major')) #Adds columns from d1 to d2
full_join(d1, d2, by = c('Name', 'Major')) #Combines all information from d1 and d2
inner_join(d1, d2, by = c('Name', 'Major')) #Combines all information from d1 and d2 for observations in both datasets
anti_join(d1, d2, by = c('Name', 'Major')) #Displays information from d1, but removes observations that are also in d2
semi_join(d1, d2, by = c('Name', 'Major')) #Displays information from d1, but removes observations that are not in d2

print("By using 2 keys the datasets are cleaner because the majors aren't repeated ")

Warning message:
"Column `Name` joining factors with different levels, coercing to character vector"Warning message:
"Column `Major` joining factors with different levels, coercing to character vector"

  Name      Major            GPA  Salary
1 Mackenzie Human Resources  3.4  54,000
2 Allie     Politics and Law 3.4  NA
3 Luke      Accounting       3.75 NA
4 Elijah    Actuarial Math   3.95 70,000
5 Abdallah  Marketing        3.1  NA

Warning message:
"Column `Name` joining factors with different levels, coercing to character vector"Warning message:
"Column `Major` joining factors with different levels, coercing to character vector"

  Name      Major           GPA  Salary
1 Mackenzie Human Resources 3.4  54,000
2 Elijah    Actuarial Math  3.95 70,000
3 Jake      Actuarial Math  NA   82,000
4 Fryer     Actuarial Math  NA   68,000
5 Tyler     Marketing       NA   40,000

Warning message:
"Column `Name` joining factors with different levels, coercing to character vector"Warning message:
"Column `Major` joining factors with different levels, coercing to character vector"

  Name      Major            GPA  Salary
1 Mackenzie Human Resources  3.4  54,000
2 Allie     Politics and Law 3.4  NA
3 Luke      Accounting       3.75 NA
4 Elijah    Actuarial Math   3.95 70,000
5 Abdallah  Marketing        3.1  NA
6 Jake      Actuarial Math   NA   82,000
7 Fryer     Actuarial Math   NA   68,000
8 Tyler     Marketing        NA   40,000

Warning message:
"Column `Name` joining factors with different levels, coercing to character vector"Warning message:
"Column `Major` joining factors with different levels, coercing to character vector"

  Name      Major           GPA  Salary
1 Mackenzie Human Resources 3.4  54,000
2 Elijah    Actuarial Math  3.95 70,000

Warning message:
"Column `Name` joining factors with different levels, coercing to character vector"Warning message:
"Column `Major` joining factors with different levels, coercing to character vector"

  Name     Major            GPA
1 Allie    Politics and Law 3.4
2 Luke     Accounting       3.75
3 Abdallah Marketing        3.1

Warning message:
"Column `Name` joining factors with different levels, coercing to character vector"Warning message:
"Column `Major` joining factors with different levels, coercing to character vector"

  Name      Major           GPA
1 Mackenzie Human Resources 3.4
2 Elijah    Actuarial Math  3.95

[1] "By using 2 keys the datasets are cleaner because the majors aren't repeated "